tutorials/capillaryRisePlates2D/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cell;

setFormat raw;

sets
(
    centerPatch_y 
    {
        type uniform;
        axis xyz;
        start (0.0 0 0);
        end (0.0 0.02208 0);
        nPoints 110;
    }
);

fields    ( alpha1 );

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
